[{"Country":"Austria","Info":"Violent extremism and terrorist attacks have been rare in Austria particularly compared to other countries. Nonetheless, certain tendencies towards radicalisation and alienation have been increasing and observable in recent years. The first Jihadist terror attack in Vienna in November 2020 was exceptional and a caesura in a country with a very low number of casualties related to extremist violence."},{"Country":"Bosnia and Herzegovina","Info":"In Bosnia and Herzegovina, we witness two types of radicalism with different ideological influence. One of them is the religiously motivated radicalism (mostly Islamic) and the other is ethno-nationalistically oriented radicalism."},{"Country":"Finland","Info":"The situation in Finland regarding terrorism, radicalisation during past 20 years is relatively rare. Yet currently Finnish Security and Intelligence Service (SUPO) estimates that the potential for both far-right and radical-Islamist violent extremism is growing. "},{"Country":"France","Info":"The substantial increase in incidents of jihadist terrorism in France in the past decade coincides with a reorganisation of the far-right and a sharp decline in ethno-nationalist and separatist violence. Political discourse, government de-radicalisation efforts and public opinion focus almost exclusively on jihadist violence, mainly due to the symbolic and traumatising effect of the 2015 Paris attacks. The fight against (jihadist) extremist violence in the past 10-15 years is characterised by two predominant elements: deliberate fusion of Islam and Muslim religious practice – especially in its stricter forms – with extremist violence; and use of educational measures in preventing violence. "},{"Country":"Georgia","Info":"The major sources of radicalisation in Georgia were from both Orthodox Christian fundamentalism and the Islamist movement In the case of the former, there is evidence that several individuals and organisations closely associated with the Georgian Orthodox Church, have united with alt-right groups. These groups have been involved in several violent attacks on LGBTQ+ members and religious minorities. In the case of the latter, there is evidence that young men from Pankisi Gorge to join ISIS in Syria and Iraq. The Muslim radicalisation, even though producing no violent incidents in Georgia, revealed that young people left to fight for ISIS and acquire fame upon their return to Georgia."},{"Country":"Germany","Info":"As research has shown, current right-wing terrorism builds on organizational structures of radicalization that have developed since the early 1990s. As the “National Socialist Underground” murders demonstrate, its ideological roots go even deeper. At the same time changes in the nature of far-right terrorism is apparent. Racist chat groups in the police, a terrorist network in the military and a democratically elected far-right party now under surveillance by the domestic intelligence agency show the complexity of structures that make right-wing terrorism possible. In comparison to right-wing extremism, evidence of jihadist terrorism appears relatively low. Apart from the deadly attack on a Christmas market in 2016, jihadism rather remains a potential threat, exemplified by the terrifying attacks in other European and non-European countries."},{"Country":"Hungary","Info":"The prevalent form of radicalisation in present-day Hungary is right-wing extremism mixed with ethno-nationalist, anti-establishment and religious elements. Ideologically speaking, such forms of extremism are motivated by the legacy of the Horthy-era Trianon Treaty and the fascist Arrow Cross Party (Nyilaskeresztes Párt). The most significant events that prompted radicalisation were party politics right after the collapse of the one-party system in 1989; the socio-economic situation and subsequent crisis of the socialist-liberal government in 2006; and the so-called “refugee crisis” in 2015. Right-wing polarisation led to the most shocking events in contemporary Hungary, the Roma murders in 2008-2009. Besides Roma, the usual targets of violence are Jews, migrants and the LGBTQI community. "},{"Country":"Iraq","Info":"Iraq is one of the countries most exposed to instability and lack of security. The fragility and weakness of the state has made Iraq a hot spot of extremism and terrorism.There is separatist extremism in Kirkuk governorate, which is one of the disputed areas between the federal government and the Kurdistan Regional Government of Iraq where the latter seeks secession and independence from Iraq. Likewise, there is the jihadist (religious) violence stemming from sectarian fanaticism in Anbar, which has made this vast province a hot spot for (discriminatory) ethnic and religious extremism."},{"Country":"Israel","Info":"For the past two decades, Israel has been dealing with two main cases of terrorism: Palestinian jihadist and radical right-wing religion-based threats. The first regards Muslim extremists opposing the Israeli Zionist state by three main nationalist movements: Hamas and Palestinian Islamist-Jihad (PIJ) on the southwestern border with Gaza, and Hizballah on the northern border with Syria and Lebanon. The second group of extremists has emerged from Jewish post-Zionist radical right-wing groups who oppose any territorial control by Palestinians and\/or Israeli-Arabs within the borders of the Israeli Jewish state."},{"Country":"Italy","Info":"Italy remains an important theatre for extremist political movements both on the left and on the right. The 2008 financial crisis, strains connected with illegal migratory influxes and the socio-economic impact of the Covid-19 pandemic are providing new platforms and audiences for extreme political movements. Left-wing violent actions have remained a constant feature of the Italian landscape. However, data showing a doubling of hate crimes in the last five years (primarily racially and xenophobically-motivated violent crimes) corroborates the perception of growing and increasingly confident right-wing extremism."},{"Country":"Jordan","Info":"Although there is no defined separation between right-wing and left-wing factions of extremism, Jordan mainly suffers from internal and external radicalized threats. Internal radicalization is manifested in state-led actions which provoke disturbance among political parties and nationalities along with its approach in tightening its security grip justified under state security; Muslim Brotherhood which is a legitimate opposing political party, tribal radicalization which threatens national unity, Salafi-Jihadism which promotes radical Islamic ideology; and refugee radicalization which is also seen as a threat to Jordanian’s welfare and peace. External radicalization is depicted through Al-Qaeda in Iraq and ISIS in Syria."},{"Country":"Kosovo","Info":"Although Kosovo has not experienced any jihadism-related terrorist attack to date, a combination of factors such as isolation, poor socio-economic opportunities and external actors seeking to impose a more conservative strain of Islam in Kosovo – galvanized by the conflicts in the Middle East - have led to the radicalisation of fringe social groups. Radicalisation has been largely manifested through the foreign fighter phenomenon and through the spread of narratives that seek to sow division, contempt for the secular state and intolerance of “the other.” Unlike in some other contexts, radicalisation in Kosovo has been closely tied to a number of individuals who sought to actively recruit new supporters for extremist groups in Syria and Iraq."},{"Country":"Poland","Info":"Poland continues to be a country with a low level of terrorist threat. However, because of its geographical location, strategic relationships with other countries and international organizations, terrorist attacks cannot be ruled out. The Internal Security Agency report showed that between 2015-2019 there were investigations into right-wing, left-wing and jihadist terrorism. Ethnonationalist\/separatist political violence is not an issue in Poland. Last mention of separatist potential threat was in 2000 report and it was related to the region of Silesia. There is also evidence of strong but decreasing political polarisation on violent threat and law on counterterrorism."},{"Country":"Serbia","Info":"There is no political awareness in Serbia about the danger posed by extreme right-wing organizations, and therefore no political will to deal with right-wing extremism. However, the different treatment of fighters who fought on the pro-Russian side in Ukraine and against Assad in Syria by the Serbian authorities can be represented as one of the drivers of radicalisation. Radical right-wing groups and organizations active in the territory of the Republic of Serbia mainly act as citizens' associations, trying to seemingly mitigate their extremism and formally adjust their activities to the legislative framework of the Republic of Serbia."},{"Country":"Slovenia","Info":"Slovenia is a secure EU country with low crime rates and almost no terrorist related activity. Nevertheless, Slovenian political elites often resort to demonizing Muslims as terrorists, both in relation to the existing Islamic minority in Slovenia and to (future possible) immigrants, although the numbers of both groups are miniscule. There are some cases of hate speech, incitement to violence in politics and the media. There are also violent attacks against minorities."},{"Country":"Turkey","Info":"Turkey has witnessed violent attacks by all four types of radicalised groups, namely ethnonationalist\/separatist, jihadist, right-wing, and left-wing since 2001. The Turkish political parties converge in their prioritization of the separatist threat over the other types. AKP (Justice and Development Party) and MHP (Nationalist Movement Party) also emphasize the potential threat from FETÖ (Gülen Terrorist Organisation) in the aftermath of 15 July 2016 coup attempt. These two parties also incriminate the opposition parties, CHP (Republican Peoples' Party) and HDP (Peoples' Democratic Party) for affiliation with the separatist and FETÖ radicalisation. The CHP, as the main opposition party, defines PKK and ISIS as terrorist organisations and warns about state-led radicalisation through the arbitrary abuse of the laws on terror in an attempt to incriminate the peaceful opposition."},{"Country":"United Kingdom","Info":"Recent radical right wing and far-right political discourse and actions in the UK should not be treated as isolated chain of events. The current ecosystem of xenophobic, misogynist, homophobic, transphobic, anti-Semitic and white nationalistsupremacist ideas, ideologies and action are the consequence of successive Conservative (Tory) governments and their lack of integration policies. The discourses and policies of the Tories have become a catalyst in the mainstreaming of radical and extremist ideas and their wider endorsement in society."}]